In [ ]:
# 판다스 사용법

* pandas란,

1. 데이터 분석을 위한 파이썬 모듈
2. 엑셀의 스프레드 시트와 같은 관계형 데이터베이스의 데이터 처리 능력이 뛰어남
3. 판다스는 Dataframe 이라는 기본 자료구조를 사용한다.
(오라클의 테이블과 판다스의 Dataframe 이 서로 유사하다.)

In [151]:
# 1. emp3.csv를 파이썬을 이용해서 판다스의 데이터 프레임으로 만들기

import pandas as pd # 판다스 모듈 호출

emp=pd.read_csv("c:\\data\\emp3.csv") # c드라이브의 emp3.csv를 emp변수에 할당
print(emp)

    index  empno   ename        job     mgr         hiredate   sal    comm  \
0       1   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN
1       2   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN
2       3   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN
3       4   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN
4       5   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0
5       6   7499   ALLEN   SALESMAN  7698.0  1981-02-11 0:00  1600   300.0
6       7   7844  TURNER   SALESMAN  7698.0  1981-08-21 0:00  1500     0.0
7       8   7900   JAMES      CLERK  7698.0  1981-12-11 0:00   950     NaN
8       9   7521    WARD   SALESMAN  7698.0  1981-02-23 0:00  1250   500.0
9      10   7902    FORD    ANALYST  7566.0  1981-12-11 0:00  3000     NaN
10     11   7369   SMITH      CLERK  7902.0  1980-12-09 0:00   800     NaN
11     12   7788   SCOTT    ANALYST  7566.0  1982-12-22 0:00  3000     NaN
12     13   7876   ADAMS      CLERK  7788.0  1983-01-15 0:00  1100     NaN
13     14   7934  MILLER      CLERK  7782.0  1982-01-11 0:00  1300     NaN

    deptno
0       10
1       30
2       10
3       20
4       30
5       30
6       30
7       30
8       30
9       20
10      20
11      20
12      20
13      10

In [154]:
# SQL ---> 판다스 문법

# 사원 테이블에서 이름과 월급을 출력하기

"""
SQL > select ename, sal from emp;
"""

# 판다스 :
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','sal']])

# emp : 데이터 프레임명 [ ['컬럼명1','컬럼명2'] ]

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
9     FORD  3000
10   SMITH   800
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

In [155]:
# SQL ---> 판다스 문법 2

# 월급, 직업, 입사일 출력하기

"""
SQL > select sal, job, hiredate from emp;
"""

import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','job','hiredate']])

     ename        job         hiredate
0     KING  PRESIDENT  1981-11-17 0:00
1    BLAKE    MANAGER  1981-05-01 0:00
2    CLARK    MANAGER  1981-05-09 0:00
3    JONES    MANAGER  1981-04-01 0:00
4   MARTIN   SALESMAN  1981-09-10 0:00
5    ALLEN   SALESMAN  1981-02-11 0:00
6   TURNER   SALESMAN  1981-08-21 0:00
7    JAMES      CLERK  1981-12-11 0:00
8     WARD   SALESMAN  1981-02-23 0:00
9     FORD    ANALYST  1981-12-11 0:00
10   SMITH      CLERK  1980-12-09 0:00
11   SCOTT    ANALYST  1982-12-22 0:00
12   ADAMS      CLERK  1983-01-15 0:00
13  MILLER      CLERK  1982-01-11 0:00

In [157]:
# 직업이 SALESMAN인 사원의 이름과 월급 출력하기

"""
SQL > select sal, job, hiredate
        from emp
        where job='SALESMAN';
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','sal']] [emp['job']=='SALESMAN'])

# 출력할 컬럼 옆에 대괄호 열고 검색 조건을 입력한다

    ename   sal
4  MARTIN  1250
5   ALLEN  1600
6  TURNER  1500
8    WARD  1250

In [161]:
# 월급이 3000 이상인 사원들의 이름과 월급 출력하기

"""
SQL > select ename, sal
        from emp
        where sal>=3000;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','sal']] [emp['sal']==3000])

# '3000'으로 해보니까 안 된다. ( SQL은 알아서 형변환 해주는데 ㅠ )

    ename   sal
9    FORD  3000
11  SCOTT  3000

In [162]:
# 월급이 1000, 3000 사이인 사원들의 이름, 월급 출력하기

"""
SQL >
select ename, sal
    from emp
    where sal between 1000 and 3000;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','sal']] [emp['sal'].between(1000,3000)])

#컬럼.between(a,b)

     ename   sal
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
8     WARD  1250
9     FORD  3000
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

In [163]:
# 월급이 1000, 3000 사이가 아닌 사원들의 이름, 월급 출력하기

"""
SQL >
select ename, sal
    from emp
    where sal not between 1000 and 3000;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','sal']] [~emp['sal'].between(1000,3000)])

# SQL의 NOT, 파이썬의 !(느낌표) 는 판다스에선 ~(물결)이다.

    ename   sal
0    KING  5000
7   JAMES   950
10  SMITH   800

In [ ]:
오라클의 기타 비교 연산자와 파이썬 판다스의 기타 비교 연산자

    오라클              판다스
    
C between a and b    C.between(a,b)
C in                 C.isin([a,b,c,d])
C is null            C.isnull()
C like               apply 함수

In [175]:
# 직업이 CLERK, SALESMAN인 사원들의 이름과 직업 출력하기

"""
SQL >
select ename, job
    from emp
    where job in ('CLERK','SALESMAN');
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','job']] [emp['job'].isin(['CLERK','SALESMAN'])])

     ename       job
4   MARTIN  SALESMAN
5    ALLEN  SALESMAN
6   TURNER  SALESMAN
7    JAMES     CLERK
8     WARD  SALESMAN
10   SMITH     CLERK
12   ADAMS     CLERK
13  MILLER     CLERK

In [176]:
# 직업이 CLERK, SALESMAN인 사원들의 이름과 직업을 출력하기

"""
SQL >
select ename, job
    from emp
    where job not in ('CLERK','SALESMAN');
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','job']] [~emp['job'].isin(['CLERK','SALESMAN'])])

    ename        job
0    KING  PRESIDENT
1   BLAKE    MANAGER
2   CLARK    MANAGER
3   JONES    MANAGER
9    FORD    ANALYST
11  SCOTT    ANALYST

In [178]:
# 커미션이 null 인 사원들의 이름과 커미션을 출력하기

"""
SQL >
select ename, comm
    from emp
    where comm is null;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','comm']] [emp['comm'].isnull()])

     ename  comm
0     KING   NaN
1    BLAKE   NaN
2    CLARK   NaN
3    JONES   NaN
7    JAMES   NaN
9     FORD   NaN
10   SMITH   NaN
11   SCOTT   NaN
12   ADAMS   NaN
13  MILLER   NaN

In [179]:
# 커미션이 null 이 아닌사원들의 이름과 커미션을 출력하기

"""
SQL >
select ename, comm
    from emp
    where comm is not null;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp[['ename','comm']] [~emp['comm'].isnull()])

    ename    comm
4  MARTIN  1400.0
5   ALLEN   300.0
6  TURNER     0.0
8    WARD   500.0